//регулярні вирази
//між слешами / /
//для перевірки 

//[abc] всі символи a, b i c
//[A-z], [A-z0-9]
//g - всы співпадіння
//i - верхні і нижні регістри
//^ - окрім
//\d+ - всі числа ідуть разом а не по окремо
//?. - тут якийсь будь-який проміжок
//\d* - якщо будуть і якщо не будуть
//+ - один чи більше символів



const str = "строка для пошуку 1 для пошуку 12 для пошуку 123";

//повертає об'єкт з вказаними правилами
const pattern1 = /\d/; //шукати елемент з 1 цифрою
const pattern1_2 = /\d\d/; //дві цифри 
const pattern2 = new RegExp(/\d/);


//метод search(), повертає індекс або -1(без співпадінь)
const searchNum = str.search(pattern1);
console.log(searchNum); //18 (індекс)

console.log(str.search(/\d\d/));
console.log(str.search(/\d\d\d\d/)); //-1


//replace() - пошук з заміною
const pattern3 = /\d\d/g; //g - глобально, кожні 2 повторювані цифри, а не лише перші
console.log(str.replace(pattern3, "[замінений текст]"))


//match()
const str2 = "1 плюс 10 рівно 5";
const resu = str2.match(/\d/g);
console.log(resu); //[ '1', '1', '0', '5' ]


//split() - розбиває строку на масив по знаку вказаному для розбивку
const str3 = "abc123efg123hig";
console.log(str3.split(/\d\d\d/)); //[ 'abc', 'efg', 'hig' ]

//exec() дуже схожий на match(), але повертає з перевіркою
//pattern.exec(str)
//завжди повертає або одне значення або null

//ЗАПИСАТИ З ФАЙЛУ


//test() - search() на регулярному виразі

//ЗАПИСАТИ З ФАЙЛУ