var x = 6;
var y = 14;
var z = 4;

document.write((x+=y-x++*z)+"<br/>");
/*
    x++: оскільки інкремент(+1) постфіксний, то збільшення x на одиницю відбудеться на наступному рядку, відповідно, x++=6 на цьому рядку (не змінюється);
    x++*z: множення виконується раніше за віднімання, тоді 6*4=24;
    y-x++*z: 14-24=-10;
    x+=y-x++*z: збільшуємо існуюче x на -10, x=6-10=-4.
*/

x = 6;
y = 14;
z = 4;
document.write((z=--x-y*5)+"<br/>");
/*
    --x: предекремент(-1) спрацює на даному рядку, відповідно, --x=5;
    y*5: 14*5=70;
    --x-y*5: 5-70=-65;
    z=--x-y*5: z=-65.
*/

x = 6;
y = 14;
z = 4;
document.write((y/=x+5%z)+"<br/>");
/*
    5%z: остача від операції ділення 5/z, 5%4=1;
    x+5%z: 6+1=7;
    y/=x+5%z: y/=7, 14/7=2.
*/

x = 6;
y = 14;
z = 4;
document.write((z-x++ +y*5)+"<br/>");
/*
    x++: оскільки постфіксний інкремент(+1) спрацює вже на наступному рядку, то x++=6; 
    y*5: 14*5=70;
    z-x++ +y*5: 4-6+70=68.
*/

x = 6;
y = 14;
z = 4;
document.write(x=y-x++*z);
/*
    x++: оскільки постфіксний інкремент(+1) спрацює вже на наступному рядку, то x++=6; 
    x++*z: 6*4=24;
    x=y-x++*z: x=14-24=-10;
*/